---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.AirSystemData.HeatExchangerType
source: html/874babfb-844a-72de-95cb-102f5f69a2d2.htm
---
# Autodesk.Revit.DB.Mechanical.AirSystemData.HeatExchangerType Property

The type of heat exchanger.

## Syntax (C#)
```csharp
public AirHeatExchangerType HeatExchangerType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration